TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2.cpp
#include "v4l2/ESP32P4_V4l2.h"

#include <Arduino.h>
#include <errno.h>
#include <fcntl.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <sys/ioctl.h>
#include <sys/stat.h>
#include <sys/time.h>
#include <unistd.h>

#include "cam/ESP32P4_Isp.h"

#if ESP32P4_HAS_V4L2
#include "esp_vfs.h"
#if __has_include("esp_video_ioctl.h")
#include "esp_video_ioctl.h"
#endif
#if __has_include("esp_video_isp_ioctl.h")
#include "esp_video_isp_ioctl.h"
#endif
#if __has_include("esp_cam_sensor_types.h")
#include "esp_cam_sensor_types.h"
#endif
#if __has_include("esp_cam_motor_types.h")
#include "esp_cam_motor_types.h"
#endif

#ifndef V4L2_CID_CAMERA_AE_LEVEL
#define V4L2_CID_CAMERA_AE_LEVEL (V4L2_CID_CAMERA_CLASS_BASE + 40)
#endif
#ifndef V4L2_CID_TEST_PATTERN
#define V4L2_CID_TEST_PATTERN (V4L2_CID_IMAGE_PROC_CLASS_BASE + 3)
#endif
#ifndef V4L2_CAP_TIMEPERFRAME
#define V4L2_CAP_TIMEPERFRAME 0x1000
#endif
#ifndef V4L2_BUF_CAP_SUPPORTS_USERPTR
#define V4L2_BUF_CAP_SUPPORTS_USERPTR (1 << 1)
#endif
#ifndef V4L2_BUF_CAP_SUPPORTS_MMAP
#define V4L2_BUF_CAP_SUPPORTS_MMAP (1 << 0)
#endif

struct ESP32P4_V4l2Vfs {
  static int open_p(void *ctx, const char *, int, int) {
    auto *self = (ESP32P4_V4l2 *)ctx;
    return self ? self->vfsOpen() : -1;
  }
  static int close_p(void *ctx, int fd) {
    auto *self = (ESP32P4_V4l2 *)ctx;
    return self ? self->vfsClose(fd) : -1;
  }
  static ssize_t read_p(void *ctx, int fd, void *dst, size_t n) {
    auto *self = (ESP32P4_V4l2 *)ctx;
    return self ? self->vfsRead(fd, dst, n) : -1;
  }
  static int ioctl_p(void *ctx, int fd, int cmd, va_list args) {
    auto *self = (ESP32P4_V4l2 *)ctx;
    void *arg = va_arg(args, void *);
    return self ? self->vfsIoctl(fd, cmd, arg) : -1;
  }
  static int fstat_p(void *ctx, int fd, struct stat *st) {
    auto *self = (ESP32P4_V4l2 *)ctx;
    return self ? self->vfsFstat(fd, st) : -1;
  }
};

struct CtrlDesc {
  uint32_t id;
  const char *name;
  const char *ctl;
  int32_t minv, maxv, step, defv;
  uint32_t type;
};

static const CtrlDesc kCtrls[] = {
    {V4L2_CID_BRIGHTNESS, "Brightness", "brightness", -128, 127, 1, 0, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_CONTRAST, "Contrast", "contrast", 0, 255, 1, 128, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_SATURATION, "Saturation", "saturation", 0, 255, 1, 128, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_HUE, "Hue", "hue", 0, 359, 1, 0, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_AUTO_WHITE_BALANCE, "White Balance, Automatic", "white_balance_automatic", 0, 1, 1, 1,
     V4L2_CTRL_TYPE_BOOLEAN},
    {V4L2_CID_RED_BALANCE, "Red Balance", "red_balance", 256, 4096, 1, 1024, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_BLUE_BALANCE, "Blue Balance", "blue_balance", 256, 4096, 1, 1024,
     V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_EXPOSURE, "Exposure", "exposure", 4, 65535, 1, 200, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_AUTOGAIN, "Automatic Gain", "autogain", 0, 1, 1, 1, V4L2_CTRL_TYPE_BOOLEAN},
    {V4L2_CID_GAIN, "Gain", "gain", 1, 480, 1, 16, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_HFLIP, "Horizontal Flip", "horizontal_flip", 0, 1, 1, 0, V4L2_CTRL_TYPE_BOOLEAN},
    {V4L2_CID_VFLIP, "Vertical Flip", "vertical_flip", 0, 1, 1, 0, V4L2_CTRL_TYPE_BOOLEAN},
    {V4L2_CID_POWER_LINE_FREQUENCY, "Power Line Frequency", "power_line_frequency", 0, 2, 1, 0,
     V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_SHARPNESS, "Sharpness", "sharpness", 0, 255, 1, 128, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_EXPOSURE_ABSOLUTE, "Exposure Time, Absolute", "exposure_time_absolute", 1, 100000, 1,
     100, V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_FOCUS_ABSOLUTE, "Focus, Absolute", "focus_absolute", 0, 1023, 1, 0,
     V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_JPEG_COMPRESSION_QUALITY, "Compression Quality", "compression_quality", 1, 100, 1, 45,
     V4L2_CTRL_TYPE_INTEGER},
    {V4L2_CID_TEST_PATTERN, "Test Pattern", "test_pattern", 0, 1, 1, 0, V4L2_CTRL_TYPE_BOOLEAN},
    {V4L2_CID_CAMERA_AE_LEVEL, "AE Target Level", "camera_ae_level", 20, 180, 1, 80,
     V4L2_CTRL_TYPE_INTEGER},
};

static constexpr int kCtrlN = (int)(sizeof(kCtrls) / sizeof(kCtrls[0]));

static const CtrlDesc *findCtrl(uint32_t id) {
  for (int i = 0; i < kCtrlN; i++) {
    if (kCtrls[i].id == id) return &kCtrls[i];
  }
  return nullptr;
}

static const CtrlDesc *findCtrlName(const char *n) {
  if (!n) return nullptr;
  for (int i = 0; i < kCtrlN; i++) {
    if (!strcasecmp(kCtrls[i].ctl, n)) return &kCtrls[i];
  }
  return nullptr;
}

struct FmtDesc {
  esp32p4_cam_pixformat_t pix;
  uint32_t fourcc;
  const char *name;
};

static const FmtDesc kFmts[] = {
    {ESP32P4_PIXFORMAT_RGB565, V4L2_PIX_FMT_RGB565, "RGB565"},
    {ESP32P4_PIXFORMAT_RGB888, V4L2_PIX_FMT_RGB24, "RGB888"},
    {ESP32P4_PIXFORMAT_YUV422, V4L2_PIX_FMT_UYVY, "UYVY"},
    {ESP32P4_PIXFORMAT_YUYV, V4L2_PIX_FMT_YUYV, "YUYV"},
    {ESP32P4_PIXFORMAT_YUV420, V4L2_PIX_FMT_YUV420, "YUV420"},
    {ESP32P4_PIXFORMAT_GRAY8, V4L2_PIX_FMT_GREY, "GRAY8"},
    {ESP32P4_PIXFORMAT_RAW8, V4L2_PIX_FMT_SRGGB8, "RAW8"},
    {ESP32P4_PIXFORMAT_RAW10, V4L2_PIX_FMT_SGRBG10, "RAW10"},
    {ESP32P4_PIXFORMAT_RAW12, V4L2_PIX_FMT_SGRBG12, "RAW12"},
    {ESP32P4_PIXFORMAT_JPEG, V4L2_PIX_FMT_JPEG, "JPEG"},
};
static constexpr int kFmtN = (int)(sizeof(kFmts) / sizeof(kFmts[0]));

static void fourcc_str(uint32_t fcc, char out[5]) {
  out[0] = (char)(fcc & 0xff);
  out[1] = (char)((fcc >> 8) & 0xff);
  out[2] = (char)((fcc >> 16) & 0xff);
  out[3] = (char)((fcc >> 24) & 0xff);
  out[4] = 0;
}

static int fail(int err) {
  errno = err;
  return -1;
}

const char *ESP32P4_V4l2::defaultPath(esp32p4_cam_bus_t bus) {
  switch (bus) {
    case ESP32P4_CAM_BUS_DVP:
      return ESP32P4_V4L2_DEV_DVP;
    case ESP32P4_CAM_BUS_SPI:
      return ESP32P4_V4L2_DEV_SPI;
    case ESP32P4_CAM_BUS_UVC_HOST:
      return ESP32P4_V4L2_DEV_UVC;
    case ESP32P4_CAM_BUS_CSI:
    default:
      return ESP32P4_V4L2_DEV_CSI;
  }
}

const char *ESP32P4_V4l2::defaultPath(ESP32P4_Camera *cam) {
  if (!cam) return ESP32P4_V4L2_DEV_CSI;
  if (cam->bus() == ESP32P4_CAM_BUS_SPI) {
    uint8_t p = cam->spiPort();
    if (p != 0 && p != 1) return ESP32P4_V4L2_DEV_SPI1;
  }
  return defaultPath(cam->bus());
}

uint32_t ESP32P4_V4l2::pixToFourcc(esp32p4_cam_pixformat_t fmt) {
  for (int i = 0; i < kFmtN; i++) {
    if (kFmts[i].pix == fmt) return kFmts[i].fourcc;
  }
  return V4L2_PIX_FMT_RGB565;
}

bool ESP32P4_V4l2::fourccToPix(uint32_t fourcc, esp32p4_cam_pixformat_t *out) {
  if (!out) return false;
  for (int i = 0; i < kFmtN; i++) {
    if (kFmts[i].fourcc == fourcc) {
      *out = kFmts[i].pix;
      return true;
    }
  }
  for (int i = 0; i < kFmtN; i++) {
    if (esp32p4_pixformat_fourcc(kFmts[i].pix) == fourcc) {
      *out = kFmts[i].pix;
      return true;
    }
  }
  return false;
}

