TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2.cpp
bool ESP32P4_V4l2::begin(ESP32P4_Camera *cam, const char *path) {
  end();
  if (!cam || !cam->detected()) {
    Serial.println("V4L2: camera not started - call cam.begin() first");
    return false;
  }
  _cam = cam;
  const char *p = path ? path : defaultPath(cam);
  strncpy(_path, p, sizeof(_path) - 1);
  _dq_ms = 2000;
  _seq = 0;
  _req_n = cam->fbCount();
  if (!registerVfs()) {
    Serial.printf("V4L2: VFS %s failed (ioctl API still works)\n", _path);
  } else {
    _fd = ::open(_path, O_RDWR);
    if (_fd < 0) Serial.printf("V4L2: open %s failed errno=%d\n", _path, errno);
  }
  Serial.printf("V4L2: %s  %s  %ux%u  %s  (camera_fb_t still works)\n", _path, cam->sensorName(),
                cam->width(), cam->height(), cam->formatName());
  return true;
}

void ESP32P4_V4l2::end() {
  for (uint8_t i = 0; i < ESP32P4_CAM_FB_MAX; i++) {
    if (_held[i] && _cam) _cam->release(_held[i]);
    _held[i] = nullptr;
  }
  if (_fd >= 0) {
    ::close(_fd);
    _fd = -1;
  }
  unregisterVfs();
  _cam = nullptr;
  _open_n = 0;
}

bool ESP32P4_V4l2::registerVfs() {
  if (_vfs) return true;
  if (_path[0] != '/') return false;
  esp_vfs_t vfs = {};
  vfs.flags = ESP_VFS_FLAG_CONTEXT_PTR;
  vfs.open_p = ESP32P4_V4l2Vfs::open_p;
  vfs.close_p = ESP32P4_V4l2Vfs::close_p;
  vfs.read_p = ESP32P4_V4l2Vfs::read_p;
  vfs.ioctl_p = ESP32P4_V4l2Vfs::ioctl_p;
  vfs.fstat_p = ESP32P4_V4l2Vfs::fstat_p;
  if (esp_vfs_register(_path, &vfs, this) != ESP_OK) return false;
  _vfs = true;
  return true;
}

void ESP32P4_V4l2::unregisterVfs() {
  if (!_vfs) return;
  (void)esp_vfs_unregister(_path);
  _vfs = false;
}

int ESP32P4_V4l2::vfsOpen() {
  if (_open_n > 8) return fail(EMFILE);
  _open_n++;
  return 0;
}

int ESP32P4_V4l2::vfsClose(int) {
  if (_open_n) _open_n--;
  return 0;
}

int ESP32P4_V4l2::vfsRead(int, void *dst, size_t size) {
  if (!_cam || !dst || !size) return fail(EINVAL);
  camera_fb_t *fb = _cam->capture(_dq_ms);
  if (!fb) return fail(EAGAIN);
  size_t n = fb->len < size ? fb->len : size;
  memcpy(dst, fb->buf, n);
  _cam->release(fb);
  return (int)n;
}

int ESP32P4_V4l2::vfsIoctl(int, int cmd, void *arg) {
  return ioctlUnlocked((unsigned long)cmd, arg);
}

int ESP32P4_V4l2::vfsFstat(int, void *stv) {
  auto *st = (struct stat *)stv;
  if (!st) return fail(EINVAL);
  memset(st, 0, sizeof(*st));
  st->st_mode = S_IFCHR | 0666;
  return 0;
}

void *ESP32P4_V4l2::mmap(size_t length, off_t offset) {
  if (!_cam) {
    errno = ENODEV;
    return (void *)-1;
  }
  uint32_t idx = (uint32_t)(offset / 4096);
  uint8_t *p = _cam->fbBuf((uint8_t)idx);
  if (!p) {
    errno = EINVAL;
    return (void *)-1;
  }
  (void)length;
  return p;
}

int ESP32P4_V4l2::munmap(void *, size_t) { return 0; }

int ESP32P4_V4l2::ioctl(unsigned long request, void *arg) { return ioctlUnlocked(request, arg); }

bool ESP32P4_V4l2::fillFmt(void *fmtv) const {
  auto *fmt = (struct v4l2_format *)fmtv;
  if (!_cam || !fmt) return false;
  if (fmt->type && fmt->type != V4L2_BUF_TYPE_VIDEO_CAPTURE) return false;
  fmt->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  auto &pix = fmt->fmt.pix;
  pix.width = _cam->width();
  pix.height = _cam->height();
  pix.pixelformat = pixToFourcc(_cam->format());
  pix.field = V4L2_FIELD_NONE;
  pix.bytesperline = (uint32_t)esp32p4_pixformat_fb_bytes(_cam->format(), _cam->width(), 1);
  if (_cam->format() == ESP32P4_PIXFORMAT_GRAY8) pix.bytesperline = _cam->width();
  pix.sizeimage =
      (uint32_t)esp32p4_pixformat_fb_bytes(_cam->format(), _cam->width(), _cam->height());
  if (_cam->format() == ESP32P4_PIXFORMAT_GRAY8)
    pix.sizeimage = (uint32_t)_cam->width() * _cam->height();
  pix.colorspace = V4L2_COLORSPACE_SRGB;
  return true;
}

bool ESP32P4_V4l2::applyFmt(void *fmtv) {
  auto *fmt = (struct v4l2_format *)fmtv;
  if (!_cam || !fmt) return false;
  if (fmt->type && fmt->type != V4L2_BUF_TYPE_VIDEO_CAPTURE) return false;
  esp32p4_cam_pixformat_t pix = ESP32P4_PIXFORMAT_RGB565;
  if (!fourccToPix(fmt->fmt.pix.pixelformat, &pix)) return false;
  if (!_cam->supportsFormat(pix)) return false;
  if (!_cam->setFormat(pix)) return false;
  return fillFmt(fmt);
}

int ESP32P4_V4l2::ioctlUnlocked(unsigned long request, void *arg) {
  if (!_cam) return fail(ENODEV);
  if (request == VIDIOC_QUERYCAP) {
    auto *cap = (struct v4l2_capability *)arg;
    if (!cap) return fail(EINVAL);
    memset(cap, 0, sizeof(*cap));
    strncpy((char *)cap->driver, "csi_vision", sizeof(cap->driver) - 1);
    strncpy((char *)cap->card, _cam->sensorName() ? _cam->sensorName() : "ESP32-P4",
            sizeof(cap->card) - 1);
    strncpy((char *)cap->bus_info, _cam->busName() ? _cam->busName() : "csi",
            sizeof(cap->bus_info) - 1);
    cap->version = (3u << 16) | (16u << 8);
    cap->capabilities = V4L2_CAP_VIDEO_CAPTURE | V4L2_CAP_STREAMING | V4L2_CAP_READWRITE |
                        V4L2_CAP_DEVICE_CAPS;
    cap->device_caps = V4L2_CAP_VIDEO_CAPTURE | V4L2_CAP_STREAMING | V4L2_CAP_READWRITE;
    return 0;
  }
  if (request == VIDIOC_ENUM_FMT) {
    auto *f = (struct v4l2_fmtdesc *)arg;
    if (!f) return fail(EINVAL);
    uint32_t want = f->index;
    uint32_t n = 0;
    for (int i = 0; i < kFmtN; i++) {
      if (!_cam->supportsFormat(kFmts[i].pix)) continue;
      if (n == want) {
        f->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
        f->flags = (kFmts[i].pix == ESP32P4_PIXFORMAT_JPEG) ? V4L2_FMT_FLAG_COMPRESSED : 0;
        strncpy((char *)f->description, kFmts[i].name, sizeof(f->description) - 1);
        f->pixelformat = kFmts[i].fourcc;
        return 0;
      }
      n++;
    }
    return fail(EINVAL);
  }
  if (request == VIDIOC_G_FMT || request == VIDIOC_TRY_FMT) {
    if (!fillFmt(arg)) return fail(EINVAL);
    return 0;
  }
  if (request == VIDIOC_S_FMT) {
    if (!applyFmt(arg)) return fail(EINVAL);
    return 0;
  }
  if (request == VIDIOC_ENUM_FRAMESIZES) {
    auto *e = (struct v4l2_frmsizeenum *)arg;
    if (!e || e->index != 0) return fail(EINVAL);
    e->type = V4L2_FRMSIZE_TYPE_DISCRETE;
    e->discrete.width = _cam->width();
    e->discrete.height = _cam->height();
    return 0;
  }
  if (request == VIDIOC_QUERYCTRL) return queryCtrlIoctl(arg);
  if (request == VIDIOC_G_CTRL) {
    auto *c = (struct v4l2_control *)arg;
    if (!c) return fail(EINVAL);
    int32_t v = 0;
    if (!getCtrl(c->id, &v)) return fail(EINVAL);
    c->value = v;
    return 0;
  }
  if (request == VIDIOC_S_CTRL) {
    auto *c = (struct v4l2_control *)arg;
    if (!c) return fail(EINVAL);
    if (!setCtrl(c->id, c->value)) return fail(EINVAL);
    return 0;
  }
  if (request == VIDIOC_G_EXT_CTRLS || request == VIDIOC_S_EXT_CTRLS ||
      request == VIDIOC_TRY_EXT_CTRLS) {
    auto *cs = (struct v4l2_ext_controls *)arg;
    if (!cs || !cs->controls) return fail(EINVAL);
    for (uint32_t i = 0; i < cs->count; i++) {
      cs->error_idx = i;
      auto &c = cs->controls[i];
#ifdef V4L2_CTRL_CLASS_ESP_CAM_IOCTL
      if (cs->ctrl_class == V4L2_CTRL_CLASS_ESP_CAM_IOCTL ||
          (c.id & 0xffff0000u) == V4L2_CTRL_CLASS_ESP_CAM_IOCTL) {
        uint32_t cmd = c.id;
        if ((cmd & 0xffff0000u) == V4L2_CTRL_CLASS_ESP_CAM_IOCTL) cmd &= 0xffff;
        size_t sz = c.size ? c.size : (size_t)ESP_CAM_SENSOR_IOC_GET_ARG(cmd);
        void *ptr = c.ptr ? c.ptr : (void *)c.p_u8;
        if (request == VIDIOC_TRY_EXT_CTRLS) continue;
        if (!_cam->sensorIoctl(cmd, ptr, sz)) return fail(EINVAL);
        continue;
      }
#endif
#if __has_include("esp_video_isp_ioctl.h")
      if (c.id >= V4L2_CID_USER_ESP_ISP_CCM && c.id <= V4L2_CID_USER_ESP_ISP_GAMMA_EXT) {
        ESP32P4_Isp *isp = _cam->isp();
        if (!isp) return fail(ENODEV);
        void *ptr = c.ptr ? c.ptr : (void *)c.p_u8;
        if (!ptr || !c.size) return fail(EINVAL);
        if (request == VIDIOC_G_EXT_CTRLS) {
          if (!isp->exportV4l2Cid(c.id, ptr, c.size)) return fail(EINVAL);
        } else if (request != VIDIOC_TRY_EXT_CTRLS) {
          if (!isp->importV4l2Cid(c.id, ptr, c.size)) return fail(EINVAL);
        }
        continue;
      }
#endif
      if (request == VIDIOC_G_EXT_CTRLS) {
        int32_t v = 0;
        if (!getCtrl(c.id, &v)) return fail(EINVAL);
        c.value = v;
      } else {
        if (!setCtrl(c.id, c.value)) return fail(EINVAL);
      }
    }
    cs->error_idx = cs->count;
    return 0;
  }
  if (request == VIDIOC_REQBUFS) {
    auto *r = (struct v4l2_requestbuffers *)arg;
    if (!r) return fail(EINVAL);
    if (r->count == 0) {
      for (uint8_t i = 0; i < ESP32P4_CAM_FB_MAX; i++) {
        if (_held[i]) {
          _cam->release(_held[i]);
          _held[i] = nullptr;
        }
      }
      _req_n = 0;
      return 0;
    }
    uint32_t n = r->count;
    if (n > _cam->fbCount()) n = _cam->fbCount();
    if (n < 2) n = _cam->fbCount() >= 2 ? 2 : _cam->fbCount();
    r->count = n;
    r->capabilities = V4L2_BUF_CAP_SUPPORTS_USERPTR | V4L2_BUF_CAP_SUPPORTS_MMAP;
    _req_n = n;
    return 0;
  }
  if (request == VIDIOC_QUERYBUF) {
    auto *b = (struct v4l2_buffer *)arg;
    if (!b || b->index >= _req_n || b->index >= ESP32P4_CAM_FB_MAX) return fail(EINVAL);
    b->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
    b->memory = b->memory ? b->memory : V4L2_MEMORY_MMAP;
    b->length =
        (uint32_t)esp32p4_pixformat_fb_bytes(_cam->format(), _cam->width(), _cam->height());
    b->m.offset = b->index * 4096u;
    b->flags = V4L2_BUF_FLAG_MAPPED;
    return 0;
  }
  if (request == VIDIOC_QBUF) {
    auto *b = (struct v4l2_buffer *)arg;
    if (!b || b->index >= ESP32P4_CAM_FB_MAX) return fail(EINVAL);
    if (_held[b->index]) {
      _cam->release(_held[b->index]);
      _held[b->index] = nullptr;
    }
    b->flags = V4L2_BUF_FLAG_QUEUED;
    return 0;
  }
  if (request == VIDIOC_DQBUF) {
    auto *b = (struct v4l2_buffer *)arg;
    if (!b) return fail(EINVAL);
    camera_fb_t *fb = _cam->capture(_dq_ms);
    if (!fb) return fail(EAGAIN);
    int idx = -1;
    for (uint8_t i = 0; i < ESP32P4_CAM_FB_MAX; i++) {
      if (_cam->fbBuf(i) == fb->buf) {
        idx = (int)i;
        break;
      }
    }
    if (idx < 0) {
      for (uint8_t i = 0; i < ESP32P4_CAM_FB_MAX; i++) {
        if (!_held[i]) {
          idx = (int)i;
          break;
        }
      }
    }
    if (idx < 0) idx = 0;
    uint32_t mem = b->memory ? b->memory : V4L2_MEMORY_USERPTR;
    if (_held[idx]) _cam->release(_held[idx]);
    _held[idx] = fb;
    memset(b, 0, sizeof(*b));
    b->index = (uint32_t)idx;
    b->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
    b->bytesused = (uint32_t)fb->len;
    b->length =
        (uint32_t)esp32p4_pixformat_fb_bytes(_cam->format(), _cam->width(), _cam->height());
    b->memory = mem;
    if (mem == V4L2_MEMORY_MMAP) {
      b->m.offset = (uint32_t)idx * 4096u;
    } else {
      b->m.userptr = (unsigned long)fb->buf;
    }
    b->flags = V4L2_BUF_FLAG_DONE | V4L2_BUF_FLAG_TIMESTAMP_MONOTONIC | V4L2_BUF_FLAG_MAPPED;
    b->sequence = _seq++;
    b->timestamp.tv_sec = (time_t)(fb->timestamp_us / 1000000u);
    b->timestamp.tv_usec = (suseconds_t)(fb->timestamp_us % 1000000u);
    b->field = V4L2_FIELD_NONE;
    return 0;
  }
  if (request == VIDIOC_STREAMON) {
    (void)_cam->startCapture();
    return 0;
  }
  if (request == VIDIOC_STREAMOFF) {
    for (uint8_t i = 0; i < ESP32P4_CAM_FB_MAX; i++) {
      if (_held[i]) {
        _cam->release(_held[i]);
        _held[i] = nullptr;
      }
    }
    (void)_cam->stopCapture();
    return 0;
  }
  if (request == VIDIOC_G_PARM) {
    auto *p = (struct v4l2_streamparm *)arg;
    if (!p) return fail(EINVAL);
    p->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
    p->parm.capture.capability = V4L2_CAP_TIMEPERFRAME;
    p->parm.capture.timeperframe.numerator = 1;
    p->parm.capture.timeperframe.denominator = _cam->modeFps() ? _cam->modeFps() : 25;
    p->parm.capture.readbuffers = _cam->fbCount();
    return 0;
  }
  if (request == VIDIOC_S_PARM) {
    auto *p = (struct v4l2_streamparm *)arg;
    if (!p) return fail(EINVAL);
    p->parm.capture.timeperframe.numerator = 1;
    p->parm.capture.timeperframe.denominator = _cam->modeFps() ? _cam->modeFps() : 25;
    return 0;
  }
#ifdef VIDIOC_S_DQBUF_TIMEOUT
  if (request == VIDIOC_S_DQBUF_TIMEOUT) {
    auto *tv = (struct timeval *)arg;
    if (!tv) return fail(EINVAL);
    _dq_ms = (uint32_t)(tv->tv_sec * 1000 + tv->tv_usec / 1000);
    if (!_dq_ms) _dq_ms = 1;
    return 0;
  }
#endif
#ifdef VIDIOC_G_DQBUF_TIMEOUT
  if (request == VIDIOC_G_DQBUF_TIMEOUT) {
    auto *tv = (struct timeval *)arg;
    if (!tv) return fail(EINVAL);
    tv->tv_sec = (time_t)(_dq_ms / 1000);
    tv->tv_usec = (suseconds_t)((_dq_ms % 1000) * 1000);
    return 0;
  }
#endif
#ifdef VIDIOC_G_SENSOR_FMT
  if (request == VIDIOC_G_SENSOR_FMT) {
    auto *sf = (esp_cam_sensor_format_t *)arg;
    if (!sf) return fail(EINVAL);
    memset(sf, 0, sizeof(*sf));
    sf->name = _cam->sensorName();
    sf->width = _cam->width();
    sf->height = _cam->height();
    sf->fps = _cam->modeFps();
    sf->port = (_cam->bus() == ESP32P4_CAM_BUS_DVP)     ? ESP_CAM_SENSOR_DVP
               : (_cam->bus() == ESP32P4_CAM_BUS_SPI)   ? ESP_CAM_SENSOR_SPI
                                                        : ESP_CAM_SENSOR_MIPI_CSI;
    return 0;
  }
#endif
#ifdef VIDIOC_S_SENSOR_FMT
  if (request == VIDIOC_S_SENSOR_FMT) {
    auto *sf = (esp_cam_sensor_format_t *)arg;
    if (!sf) return fail(EINVAL);
    if (sf->width && sf->height && (sf->width != _cam->width() || sf->height != _cam->height())) {
      return fail(EINVAL);
    }
    return 0;
  }
#endif
#ifdef VIDIOC_SET_OWNER
  if (request == VIDIOC_SET_OWNER) {
    _owner = arg ? *(int *)arg : 0;
    return 0;
  }
#endif
#ifdef VIDIOC_G_MOTOR_FMT
  if (request == VIDIOC_G_MOTOR_FMT) {
    auto *mf = (esp_cam_motor_format_t *)arg;
    if (!mf) return fail(EINVAL);
    if (!_cam->afPresent()) return fail(ENODEV);
    memset(mf, 0, sizeof(*mf));
    mf->name = "DW9714";
    mf->mode = ESP_CAM_MOTOR_DIRECT_MODE;
    mf->init_position = (int)_cam->afPosition();
    return 0;
  }
#endif
#ifdef VIDIOC_S_MOTOR_FMT
  if (request == VIDIOC_S_MOTOR_FMT) {
    if (!_cam->afPresent()) return fail(ENODEV);
    return 0;
  }
#endif
  return fail(ENOTTY);
}

int ESP32P4_V4l2::queryCtrlIoctl(void *qcv) {
  auto *qc = (struct v4l2_queryctrl *)qcv;
  if (!qc) return fail(EINVAL);
  uint32_t id = qc->id;
  bool next = (id & V4L2_CTRL_FLAG_NEXT_CTRL) != 0;
  id &= ~V4L2_CTRL_FLAG_NEXT_CTRL;
  const CtrlDesc *d = nullptr;
  if (next) {
    for (int i = 0; i < kCtrlN; i++) {
      if (kCtrls[i].id > id) {
        d = &kCtrls[i];
        break;
      }
    }
  } else {
    d = findCtrl(id);
  }
  if (!d) return fail(EINVAL);
  memset(qc, 0, sizeof(*qc));
  qc->id = d->id;
  qc->type = d->type;
  strncpy((char *)qc->name, d->name, sizeof(qc->name) - 1);
  qc->minimum = d->minv;
  qc->maximum = d->maxv;
  qc->step = d->step;
  qc->default_value = d->defv;
  qc->flags = V4L2_CTRL_FLAG_SLIDER;
  return 0;
}

