TheZeroHz/ESP32CSI_Vision/src/v4l2/ESP32P4_V4l2.cpp
bool ESP32P4_V4l2::ctrlMeta(uint32_t id, const char **name, int32_t *minv, int32_t *maxv,
                            int32_t *step, int32_t *defv, uint32_t *type) const {
  const CtrlDesc *d = findCtrl(id);
  if (!d) return false;
  if (name) *name = d->name;
  if (minv) *minv = d->minv;
  if (maxv) *maxv = d->maxv;
  if (step) *step = d->step;
  if (defv) *defv = d->defv;
  if (type) *type = d->type;
  return true;
}

bool ESP32P4_V4l2::queryCtrl(uint32_t id, char *name, int32_t *minv, int32_t *maxv, int32_t *step,
                             int32_t *defv) const {
  const char *n = nullptr;
  if (!ctrlMeta(id, &n, minv, maxv, step, defv, nullptr)) return false;
  if (name && n) strncpy(name, n, 31);
  return true;
}

bool ESP32P4_V4l2::setCtrl(uint32_t id, int32_t value) {
  if (!_cam) return false;
  switch (id) {
    case V4L2_CID_BRIGHTNESS:
      return _cam->setBrightness((int8_t)value);
    case V4L2_CID_CONTRAST:
      return _cam->setContrast((uint8_t)value);
    case V4L2_CID_SATURATION:
      return _cam->setSaturation((uint8_t)value);
    case V4L2_CID_HUE:
      return _cam->setHue((uint16_t)value);
    case V4L2_CID_AUTO_WHITE_BALANCE:
      return _cam->setAwb(value != 0);
    case V4L2_CID_RED_BALANCE:
      return _cam->setRedBalance(value);
    case V4L2_CID_BLUE_BALANCE:
      return _cam->setBlueBalance(value);
    case V4L2_CID_EXPOSURE:
      return _cam->setExposure((uint16_t)value);
    case V4L2_CID_AUTOGAIN: {
      bool ok = _cam->setAGC(value != 0);
      (void)_cam->setIspAe(value != 0);
      return ok || _cam->ispReady();
    }
    case V4L2_CID_GAIN:
      return _cam->setGain((uint16_t)value);
    case V4L2_CID_HFLIP:
      return _cam->setHMirror(value != 0);
    case V4L2_CID_VFLIP:
      return _cam->setVFlip(value != 0);
    case V4L2_CID_POWER_LINE_FREQUENCY: {
      uint8_t hz = 0;
      if (value == V4L2_CID_POWER_LINE_FREQUENCY_50HZ) hz = 50;
      else if (value == V4L2_CID_POWER_LINE_FREQUENCY_60HZ) hz = 60;
      return _cam->setAntiFlicker(hz);
    }
    case V4L2_CID_SHARPNESS:
      return _cam->setSharpness((uint8_t)value);
    case V4L2_CID_EXPOSURE_ABSOLUTE:
      return _cam->setExposureTime(value);
    case V4L2_CID_FOCUS_ABSOLUTE:
      if (!_cam->afPresent()) (void)_cam->afBegin();
      return _cam->setAfPosition((uint16_t)value);
    case V4L2_CID_JPEG_COMPRESSION_QUALITY:
      return _cam->setJpegQuality((uint8_t)value);
    case V4L2_CID_TEST_PATTERN:
      return _cam->setTestPattern(value != 0);
    case V4L2_CID_CAMERA_AE_LEVEL:
      return _cam->setAeTarget((uint8_t)value);
    default:
      return false;
  }
}

bool ESP32P4_V4l2::getCtrl(uint32_t id, int32_t *value) const {
  if (!_cam || !value) return false;
  bool b = false;
  uint16_t u16 = 0;
  switch (id) {
    case V4L2_CID_BRIGHTNESS:
      *value = _cam->brightness();
      return true;
    case V4L2_CID_CONTRAST:
      *value = _cam->contrast();
      return true;
    case V4L2_CID_SATURATION:
      *value = _cam->saturation();
      return true;
    case V4L2_CID_HUE:
      *value = _cam->hue();
      return true;
    case V4L2_CID_AUTO_WHITE_BALANCE:
      *value = (_cam->isp() && _cam->isp()->awbEnabled()) ? 1 : 0;
      return true;
    case V4L2_CID_RED_BALANCE:
      *value = _cam->isp() ? _cam->isp()->redBalance() : 1024;
      return true;
    case V4L2_CID_BLUE_BALANCE:
      *value = _cam->isp() ? _cam->isp()->blueBalance() : 1024;
      return true;
    case V4L2_CID_EXPOSURE:
      if (!_cam->getExposure(&u16)) return false;
      *value = u16;
      return true;
    case V4L2_CID_AUTOGAIN:
      if (_cam->getAGC(&b)) {
        *value = b ? 1 : 0;
        return true;
      }
      *value = (_cam->isp() && _cam->isp()->aeEnabled()) ? 1 : 0;
      return true;
    case V4L2_CID_GAIN:
      if (!_cam->getGain(&u16)) return false;
      *value = u16;
      return true;
    case V4L2_CID_HFLIP:
      if (!_cam->getHMirror(&b)) return false;
      *value = b ? 1 : 0;
      return true;
    case V4L2_CID_VFLIP:
      if (!_cam->getVFlip(&b)) return false;
      *value = b ? 1 : 0;
      return true;
    case V4L2_CID_POWER_LINE_FREQUENCY: {
      uint8_t hz = _cam->antiFlicker();
      *value = (hz == 50) ? 1 : (hz == 60) ? 2 : 0;
      return true;
    }
    case V4L2_CID_SHARPNESS:
      *value = _cam->sharpness();
      return true;
    case V4L2_CID_EXPOSURE_ABSOLUTE:
      return _cam->getExposureTime(value);
    case V4L2_CID_FOCUS_ABSOLUTE:
      *value = _cam->afPosition();
      return true;
    case V4L2_CID_JPEG_COMPRESSION_QUALITY:
      *value = _cam->jpegQuality();
      return true;
    case V4L2_CID_TEST_PATTERN:
      *value = _cam->testPattern() ? 1 : 0;
      return true;
    case V4L2_CID_CAMERA_AE_LEVEL:
      *value = _cam->aeTarget();
      return true;
    default:
      return false;
  }
}

void ESP32P4_V4l2::listCtrls() const {
  Serial.println("V4L2: controls (v4l2-ctl --list-ctrls)");
  for (int i = 0; i < kCtrlN; i++) {
    int32_t v = 0;
    (void)getCtrl(kCtrls[i].id, &v);
    Serial.printf("  %-28s 0x%08x (%s) : min=%d max=%d step=%d default=%d value=%d\n",
                  kCtrls[i].ctl, (unsigned)kCtrls[i].id,
                  kCtrls[i].type == V4L2_CTRL_TYPE_BOOLEAN ? "bool" : "int", kCtrls[i].minv,
                  kCtrls[i].maxv, kCtrls[i].step, kCtrls[i].defv, (int)v);
  }
}

void ESP32P4_V4l2::listFormats() const {
  if (!_cam) return;
  Serial.printf("V4L2: formats on %s (v4l2-ctl --list-formats)\n", _path);
  uint32_t idx = 0;
  for (int i = 0; i < kFmtN; i++) {
    if (!_cam->supportsFormat(kFmts[i].pix)) continue;
    char fcc[5];
    fourcc_str(kFmts[i].fourcc, fcc);
    Serial.printf("  [%u]: '%s' (%s)%s\n", (unsigned)idx, fcc, kFmts[i].name,
                  kFmts[i].pix == _cam->format() ? " *" : "");
    idx++;
  }
  Serial.printf("  size: %ux%u  fps=%u\n", _cam->width(), _cam->height(),
                (unsigned)_cam->modeFps());
}

static void skip_ws(const char *&s) {
  while (*s == ' ' || *s == '\t' || *s == '\r' || *s == '\n') s++;
}

int ESP32P4_V4l2::ctl(const char *cmdline) {
  if (!cmdline) return -1;
  const char *s = cmdline;
  skip_ws(s);
  if (!strncmp(s, "v4l2-ctl", 8)) {
    s += 8;
    skip_ws(s);
  }
  if (strstr(s, "--list-ctrls")) {
    listCtrls();
    return 0;
  }
  if (strstr(s, "--list-formats")) {
    listFormats();
    return 0;
  }
  if (strstr(s, "--get-fmt-video") || strstr(s, "--all")) {
    listFormats();
    if (strstr(s, "--all")) listCtrls();
    struct v4l2_format fmt = {};
    fmt.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
    if (fillFmt(&fmt)) {
      char fcc[5];
      fourcc_str(fmt.fmt.pix.pixelformat, fcc);
      Serial.printf(
          "Format Video Capture:\n\tWidth/Height      : %u/%u\n\tPixel Format      : '%s'\n",
          (unsigned)fmt.fmt.pix.width, (unsigned)fmt.fmt.pix.height, fcc);
    }
    return 0;
  }
  const char *p = strstr(s, "--set-fmt-video=");
  if (p) {
    p += 16;
    const char *pix = strstr(p, "pixelformat=");
    if (pix) {
      pix += 12;
      char tok[8]{};
      int n = 0;
      while (pix[n] && pix[n] != ',' && pix[n] != ' ' && n < 7) {
        tok[n] = pix[n];
        n++;
      }
      uint32_t fcc = 0;
      if (n == 4)
        fcc = (uint32_t)tok[0] | ((uint32_t)tok[1] << 8) | ((uint32_t)tok[2] << 16) |
              ((uint32_t)tok[3] << 24);
      esp32p4_cam_pixformat_t fmt;
      if (!fourccToPix(fcc, &fmt) || !_cam->setFormat(fmt)) {
        Serial.println("V4L2: set-fmt-video failed");
        return -1;
      }
      Serial.printf("V4L2: pixelformat %s\n", _cam->formatName());
    }
    return 0;
  }
  p = strstr(s, "--set-ctrl");
  if (p) {
    const char *q = strchr(p, ' ');
    if (!q) q = strchr(p, '=');
    if (!q) return -1;
    skip_ws(q);
    char buf[160];
    strncpy(buf, q, sizeof(buf) - 1);
    char *save = nullptr;
    for (char *tok = strtok_r(buf, ", ", &save); tok; tok = strtok_r(nullptr, ", ", &save)) {
      char *eq = strchr(tok, '=');
      if (!eq) continue;
      *eq = 0;
      const CtrlDesc *d = findCtrlName(tok);
      if (!d) {
        Serial.printf("V4L2: unknown ctrl %s\n", tok);
        continue;
      }
      int32_t v = (int32_t)atoi(eq + 1);
      if (!setCtrl(d->id, v)) Serial.printf("V4L2: set %s failed\n", tok);
      else Serial.printf("V4L2: %s=%d\n", tok, (int)v);
    }
    return 0;
  }
  p = strstr(s, "--get-ctrl");
  if (p) {
    const char *q = strchr(p, ' ');
    if (!q) return -1;
    skip_ws(q);
    char buf[160];
    strncpy(buf, q, sizeof(buf) - 1);
    char *save = nullptr;
    for (char *tok = strtok_r(buf, ", ", &save); tok; tok = strtok_r(nullptr, ", ", &save)) {
      const CtrlDesc *d = findCtrlName(tok);
      int32_t v = 0;
      if (!d || !getCtrl(d->id, &v)) Serial.printf("%s: n/a\n", tok);
      else Serial.printf("%s: %d\n", tok, (int)v);
    }
    return 0;
  }
  p = strstr(s, "--stream-count=");
  if (p) {
    int n = atoi(p + 15);
    if (n < 1) n = 1;
    for (int i = 0; i < n; i++) {
      camera_fb_t *fb = dqbuf(_dq_ms);
      if (!fb) {
        Serial.println("V4L2: DQBUF timeout");
        return -1;
      }
      Serial.printf("V4L2: frame %d  %ux%u  %u bytes  %s\n", i, fb->width, fb->height,
                    (unsigned)fb->len, esp32p4_pixformat_name(fb->format));
      qbuf(fb);
    }
    return 0;
  }
  Serial.println(
      "V4L2: try --list-ctrls | --list-formats | --set-ctrl name=val | --get-fmt-video");
  return -1;
}

camera_fb_t *ESP32P4_V4l2::dqbuf(uint32_t timeout_ms) {
  if (!_cam) return nullptr;
  return _cam->capture(timeout_ms ? timeout_ms : _dq_ms);
}

void ESP32P4_V4l2::qbuf(camera_fb_t *fb) {
  if (_cam && fb) _cam->release(fb);
}

#else /* !ESP32P4_HAS_V4L2 */

const char *ESP32P4_V4l2::defaultPath(esp32p4_cam_bus_t) { return "/dev/video0"; }
const char *ESP32P4_V4l2::defaultPath(ESP32P4_Camera *) { return "/dev/video0"; }
uint32_t ESP32P4_V4l2::pixToFourcc(esp32p4_cam_pixformat_t fmt) {
  return esp32p4_pixformat_fourcc(fmt);
}
bool ESP32P4_V4l2::fourccToPix(uint32_t, esp32p4_cam_pixformat_t *) { return false; }
bool ESP32P4_V4l2::begin(ESP32P4_Camera *, const char *) {
  Serial.println("V4L2: linux/videodev2.h not in this core");
  return false;
}
void ESP32P4_V4l2::end() {}
int ESP32P4_V4l2::ioctl(unsigned long, void *) { return -1; }
bool ESP32P4_V4l2::setCtrl(uint32_t, int32_t) { return false; }
bool ESP32P4_V4l2::getCtrl(uint32_t, int32_t *) const { return false; }
bool ESP32P4_V4l2::queryCtrl(uint32_t, char *, int32_t *, int32_t *, int32_t *, int32_t *) const {
  return false;
}
void ESP32P4_V4l2::listCtrls() const {}
void ESP32P4_V4l2::listFormats() const {}
int ESP32P4_V4l2::ctl(const char *) { return -1; }
camera_fb_t *ESP32P4_V4l2::dqbuf(uint32_t) { return nullptr; }
void ESP32P4_V4l2::qbuf(camera_fb_t *) {}
void *ESP32P4_V4l2::mmap(size_t, off_t) { return (void *)-1; }
int ESP32P4_V4l2::munmap(void *, size_t) { return -1; }

#endif
